  
#Область ПрограммныйИнтерфейс 

//***Добавлено Ивашко ВКМ_{
Процедура ВКМ_ТелеграмУведомление() Экспорт
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Приемник = "bot"+Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить()+"/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(Приемник); 
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
		ДанныеСообщения.Вставить("text", ВыборкаДетальныеЗаписи.ТекстСообщения);
		
		СтрокаJSON = СтрокаJSON(ДанныеСообщения);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		//HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			//Результат = HTTPОтвет.ПолучитьТелоКакСтроку();
			СпрОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СпрОбъект.Удалить();
		Иначе
			ИиформацияОбОшибке = ИнформацияОбОшибке(); 
			
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
	 	ПодробноеПредставлениеОшибки(ИиформацияОбОшибке));
			
		КонецЕсли;
		
	КонецЦикла;		
	// ВКМ_}
КонецПроцедуры
  
#КонецОбласти  
  
#Область СлужебныеПроцедурыИФункции 

//***Добавлено Ивашко ВКМ_{
Функция СтрокаJSON(ОбъектJSON) 
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	//ВКМ_}
КонецФункции

#КонецОбласти